[Training]
SeraphVendor=The Seraph Crystal Merchant sells high-end gear, but only accepts Seraph Crystals as payment..<br><br>Crystal Serf, Dead Zone Torch, Guardian Serf.
SeraphVendorTitle=Seraphim crystal for sale
RaidLockout=This button is disabled This boss was killed by one or more players today.
RaidLockoutTitle=The key is control
HealthAttrition=The player's health is temporarily reduced each time they regenerate during battle.
HealthAttritionTitle=Fear The Reaper